# MySQL Movie ETL Prep

In [1]:
#Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine

In [2]:
connection_str = "mysql+pymysql://root:root@localhost/Movies"
engine = create_engine(connection_str)
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

# Specifications - Database


- My stakeholder wants me to take the data I have been cleaning and collecting in Parts 1 & 2 of the project, and create a MySQL database for them.

- You should normalize the tables as best you can before adding them to your new database.

    - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).  
    - You only need to keep the imdb_id, revenue, budget, and certification columns

# Normalizing Genres

- Convert the single string of genres from title basics into 2 new tables.
- title_genres: with the columns:
    - tconst
    - genre_id
- genres:
    - genre_id
    - genre_name

In [3]:
df = pd.read_csv('Data/basics.csv.gz', low_memory = False)
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [4]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
79176,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
79177,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79178,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
79179,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79180,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [5]:
#use .explode() to separate the list of genres into new rows: one row for 
#each genre a movie belonged to.
exploded_genres = df.explode('genres_split')
exploded_genres[['tconst', 'primaryTitle', 'genres_split']]

,tconst,primaryTitle,genres_split
0,tt0035423,Kate & Leopold,Comedy
0,tt0035423,Kate & Leopold,Fantasy
0,tt0035423,Kate & Leopold,Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,Drama
2,tt0069049,The Other Side of the Wind,Drama
...,...,...,...
79179,tt9916190,Safeguard,Action
79179,tt9916190,Safeguard,Adventure
79179,tt9916190,Safeguard,Thriller
79180,tt9916362,Coven,Drama
79180,tt9916362,Coven,History

In [6]:
#use .unique() to get the unique genres from the genres_split column
unique_genres = sorted(exploded_genres['genres_split'].unique())

# Create a new title_genres table

In [7]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [8]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79179  tt9916190         0
79179  tt9916190         2
79179  tt9916190        23
79180  tt9916362         7
79180  tt9916362        11

[147988 rows x 2 columns]

In [10]:
#Convert the genre map dictionary into a dataframe.
genres_df = pd.DataFrame({'genre_name': genre_map.keys(),
                           'genre_id': genre_map.values()})
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Title_Genres Table to MySQL

In [11]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [12]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
title_genre_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [13]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genre_schema,if_exists='replace',index=False)

In [14]:
q = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

# Genres Table to MySQL

In [15]:
genres_df.dtypes

genre_name    object
genre_id       int64
dtype: object

In [16]:
genre_name_len = genres_df['genre_name'].fillna('').map(len).max()
genres_df_schema = {
    "genre_name": Text(genre_name_len+1),
    'genre_id':Integer()}

In [17]:
# Save to sql with dtype and index=False
genres_df.to_sql('genres',engine,dtype=genres_df_schema,if_exists='replace',index=False)

In [18]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [19]:
q = """
SELECT *
FROM genres
LIMIT 5
"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Discard from Basics Table

In [20]:
df = df.drop(columns = ['originalTitle','isAdult', 'titleType', 'genres', 'genres_split'])
df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74
...,...,...,...,...,...
79176,tt9914942,Life Without Sara Amat,2019,NaN,74
79177,tt9915872,The Last White Witch,2019,NaN,97
79178,tt9916170,The Rehearsal,2019,NaN,51
79179,tt9916190,Safeguard,2020,NaN,90
79180,tt9916362,Coven,2020,NaN,92

In [21]:
df.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [22]:
title_len = df['primaryTitle'].fillna('').map(len).max()
basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [23]:
df.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

In [24]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [25]:
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0093119,Grizzly II: Revenge,2020,None,74

# Convert Ratings

In [26]:
ratings = pd.read_csv('Data/ratings.csv.gz', low_memory = False)

In [27]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [28]:
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    'numVotes':Integer()}

In [29]:
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

In [30]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [31]:
q = """
SELECT *
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     83547
1  tt0062336            6.4       161
2  tt0069049            6.7      7187
3  tt0088751            5.2       319
4  tt0093119            2.9      1110

# Convert TMBD Data

In [32]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz', low_memory = False)
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

        imdb_id     revenue      budget certification
0             0         NaN         NaN           NaN
1     tt0035423  76019048.0  48000000.0         PG-13
2     tt0114447         0.0         0.0           NaN
3     tt0118589   5271666.0  22000000.0         PG-13
4     tt0118652         0.0   1000000.0             R
...         ...         ...         ...           ...
2489  tt7797670         0.0         0.0           NaN
2490  tt7797790         0.0         0.0           NaN
2491  tt8665056         0.0         0.0           NaN
2492  tt8795764         0.0         0.0            NR
2493  tt9071078         0.0         0.0           NaN

[2494 rows x 4 columns]

In [33]:
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [34]:
certification_len = tmdb_data['certification'].fillna('').map(len).max()
tmdb_schema = {
    "imdb_id": String(key_len+1),
    "revenue": Float(),
    'budget':Float(),
    'certification': Text(certification_len+1)}

In [35]:
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

In [36]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry 'tt0257106' for key 'tmdb_data.PRIMARY'")
[SQL: ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)